# 직접 해보세요!
## 제곱 함수와 n 제곱 함수 만들기(202쪽)

apply 메소드는 사용자가 작성한 함수를 한 번에 데이터프레임의 각 행과 열에 적용하여 실행할 수 있도록 해주는 함수이다.
물론 for문을 사용하여 적용할 수 있지만, apply 가 훨씬 빠르다.


시리즈는 aggregation 을 못 가지고 있음. 데이터프레임이나 그룹이 가능함. 그룹바이객체 가능함. (Series.groupby => 서브시리즈 가능함)

agg<br>
map : 시리즈만 가지고 있다. 일차원데이터, 각 벡터를 함수를 통해서 다른 요소로 변화시키는 것. <br>
transform: 데이터프레임이나 그룹만 가지고 있다. 2차원 공간에 있는 각 시리즈를 일대일 대응해서 다른 시리즈로 만드는 것. 그런데 각각 시리즈별로 map 함수를 사용하지만, 각각 시리즈마다 다른 함수를 적용할 수 있다. <br>
applymap : 데이터프레임만 가지고 있다.  2 차원 요소의 각 성분을 어떤 함수를 통해서 변화시키는 것. 똑같이 2차원으로 만든다. 어쨌든 각 개별 스칼라를 다룬다. <br>
공통된 의미 : 각 스칼라를 개별 스칼라로 바꿔준다 .. ?


**apply**: 메소드를 호출한 컨테이너의 각 요소에 대한 reduce, map 기타 등등의 연산을 수행할 수 있다. 
데이터프레임이나 그룹을 가지고 수행할 수 있다.

In [10]:
import pandas as pd
import numpy as np
s = pd.Series([1,2,3])
df = pd.DataFrame({'a': [1,2,3], 
          'b': [4,5,6], 
          'c': [7,8,9],
          'd' : [10,11,12]})


df2 = pd.DataFrame(np.arange(15).reshape(5,3), columns=list("abc"))

In [11]:
df2

    a   b   c
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [12]:
df

   a  b  c   d
0  1  4  7  10
1  2  5  8  11
2  3  6  9  12

In [13]:
df2.agg({'a':['sum','min','max'],'b':['min', 'max','sum']})

      a   b
max  12  13
min   0   1
sum  30  35

In [14]:
s.apply(lambda x : x**2)

0    1
1    4
2    9
dtype: int64

In [15]:
s.map(lambda x : x**2)

0    1
1    4
2    9
dtype: int64

In [16]:
df.transform([np.sqrt, np.exp])

          a                    b                     c                      d  \
       sqrt        exp      sqrt         exp      sqrt          exp      sqrt
0  1.000000   2.718282  2.000000   54.598150  2.645751  1096.633158  3.162278
1  1.414214   7.389056  2.236068  148.413159  2.828427  2980.957987  3.316625
2  1.732051  20.085537  2.449490  403.428793  3.000000  8103.083928  3.464102


             exp
0   22026.465795
1   59874.141715
2  162754.791419

In [17]:
df.apply([np.sqrt, np.exp])

          a                    b                     c                      d  \
       sqrt        exp      sqrt         exp      sqrt          exp      sqrt
0  1.000000   2.718282  2.000000   54.598150  2.645751  1096.633158  3.162278
1  1.414214   7.389056  2.236068  148.413159  2.828427  2980.957987  3.316625
2  1.732051  20.085537  2.449490  403.428793  3.000000  8103.083928  3.464102


             exp
0   22026.465795
1   59874.141715
2  162754.791419

In [18]:
s.map(np.sqrt)

0    1.000000
1    1.414214
2    1.732051
dtype: float64

In [19]:
s.apply([np.sqrt, np.exp])

       sqrt        exp
0  1.000000   2.718282
1  1.414214   7.389056
2  1.732051  20.085537

In [20]:
s.applymap([np.sqrt, np.exp])

AttributeError: 'Series' object has no attribute 'applymap'

In [21]:
df.agg('mean')

a     2.0
b     5.0
c     8.0
d    11.0
dtype: float64

In [22]:
df.agg(['mean','sum'])

        a     b     c     d
mean  2.0   5.0   8.0  11.0
sum   6.0  15.0  24.0  33.0

In [23]:
def my_sq(x):
    return x ** 2

In [24]:
def my_exp(x, n):
    return x ** n

In [25]:
print(my_sq(4))

16

In [26]:
print(my_exp(2, 4))

16

# 직접 해보세요!
## 시리즈와 데이터프레임에 apply 메서드 사용하기(203쪽)

### 1. 시리즈와 apply 메서드

In [27]:
import pandas as pd

df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]}) 

print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [28]:
print(df['a'] ** 2)

0    100
1    400
2    900
Name: a, dtype: int64

In [29]:
sq = df['a'].apply(my_sq) 
print(sq)

0    100
1    400
2    900
Name: a, dtype: int64

In [30]:
ex = df['a'].apply(my_exp, n=2) 
print(ex)

0    100
1    400
2    900
Name: a, dtype: int64

In [31]:
ex = df['a'].apply(lambda x : my_exp(x,2)) 
print(ex)

0    100
1    400
2    900
Name: a, dtype: int64

In [32]:
ex = df['a'].apply(my_exp, n=3) 
print(ex)

0     1000
1     8000
2    27000
Name: a, dtype: int64

### 5. 데이터 프레임과 apply 메서드

In [33]:
df = pd.DataFrame({'a': [10, 20, 30], 'b': [20, 30, 40]}) 
print(df)

    a   b
0  10  20
1  20  30
2  30  40

In [34]:
df.apply(my_sq)

     a     b
0  100   400
1  400   900
2  900  1600

In [35]:
def print_me(x): 
    print(x)

In [36]:
print(df.apply(print_me, axis=1))

a    10
b    20
Name: 0, dtype: int64
a    20
b    30
Name: 1, dtype: int64
a    30
b    40
Name: 2, dtype: int64
0    None
1    None
2    None
dtype: object

In [37]:
print(df.apply(print_me, axis=0))

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64
a    None
b    None
dtype: object

In [52]:
print(df['a'])

0    10
1    20
2    30
Name: a, dtype: int64

In [53]:
print(df['b'])

0    20
1    30
2    40
Name: b, dtype: int64

In [54]:
def avg_3(x, y, z):
    return (x + y + z) / 3

In [59]:
try :
    df.apply(avg_3)
except TypeError as e:
    print(e)


# print(df.apply(avg_3))

avg_3() missing 2 required positional arguments: 'y' and 'z'

In [60]:
#수정한 함수 적용  : 컬럼 하나에 인자 하나를 대입해야 함. 

def avg_3_apply(col):
    x = col[0] 
    y = col[1] 
    z = col[2] 
    return (x + y + z) / 3


print(df.apply(avg_3_apply))

a    20.0
b    30.0
dtype: float64

In [61]:
df.apply(avg_3_apply)

a    20.0
b    30.0
dtype: float64

In [62]:
def avg_3_apply(col):
    sum = 0
    for item in col:
         sum += item
    return sum / df.shape[0]

In [31]:
def avg_2_apply(row):
    sum = 0
    for item in row:
        sum += item
    return sum / df.shape[1]

In [32]:
print(df.apply(avg_2_apply, axis = 1))

0    15.0
1    25.0
2    35.0
dtype: float64

In [70]:
df

    a   b
0  10  20
1  20  30
2  30  40

In [69]:
def avg_3_apply(col):
    return np.mean(col)


print(df.apply(avg_3_apply))
print(df.apply(avg_3_apply, axis= 1))

a    20.0
b    30.0
dtype: float64
0    15.0
1    25.0
2    35.0
dtype: float64

sns의 tips데이터에서 sex와 time별 tipRate top5 를 구하여라 .

In [111]:
import seaborn as sns 

tips = sns.load_dataset("tips") 
# print(tips.head())
# print(type(tips))

tips['tipRate']= tips['tip']/tips['total_bill']

def top5(df) :
    
    return df.sort_values(by='tipRate', ascending=False).head(5)


tips.groupby(['sex','time']).apply(top5)

                   total_bill   tip     sex smoker   day    time  size  \
sex    time
Male   Lunch  149        7.51  2.00    Male     No  Thur   Lunch     2
              194       16.58  4.00    Male    Yes  Thur   Lunch     2
              88        24.71  5.85    Male     No  Thur   Lunch     2
              222        8.58  1.92    Male    Yes   Fri   Lunch     1
              87        18.28  4.00    Male     No  Thur   Lunch     2
       Dinner 172        7.25  5.15    Male    Yes   Sun  Dinner     2
              232       11.61  3.39    Male     No   Sat  Dinner     2
              183       23.17  6.50    Male    Yes   Sun  Dinner     4
              181       23.33  5.65    Male    Yes   Sun  Dinner     2
              185       20.69  5.00    Male     No   Sun  Dinner     5
Female Lunch  221       13.42  3.48  Female    Yes   Fri   Lunch     2
              191       19.81  4.19  Female    Yes  Thur   Lunch     2
              139       13.16  2.75  Female     No  Thur   Lunch     2
              124       12.48  2.52  Female     No  Thur   Lunch     2
              140       17.47  3.50  Female     No  Thur   Lunch     2
       Dinner 178        9.60  4.00  Female    Yes   Sun  Dinner     2
              67         3.07  1.00  Female    Yes   Sat  Dinner     1
              109       14.31  4.00  Female    Yes   Sat  Dinner     2
              93        16.32  4.30  Female    Yes   Fri  Dinner     2
              51        10.29  2.60  Female     No   Sun  Dinner     2

                    tipRate
sex    time
Male   Lunch  149  0.266312
              194  0.241255
              88   0.236746
              222  0.223776
              87   0.218818
       Dinner 172  0.710345
              232  0.291990
              183  0.280535
              181  0.242177
              185  0.241663
Female Lunch  221  0.259314
              191  0.211509
              139  0.208967
              124  0.201923
              140  0.200343
       Dinner 178  0.416667
              67   0.325733
              109  0.279525
              93   0.263480
              51   0.252672

# 직접 해보세요!
## 데이터프레임의 누락값을 처리한 다음 apply 메서드 사용하기(208쪽)

### 1. 데이터프레임의 누락값 처리하기 ― 열 방향

In [112]:
import seaborn as sns

titanic = sns.load_dataset("titanic")

In [114]:
print(titanic.info()) #embark_town : 탑승한 지역

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

In [115]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [118]:
import numpy as np

def count_missing(vec):
    null_vec = pd.isnull(vec)
    null_count = np.sum(null_vec)
    return null_count

In [117]:
import numpy as np

def count_missing2(vec):
   
    return npd.isnull(vec).sum()

In [119]:
cmis_col = titanic.apply(count_missing)
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [120]:
def prop_missing(vec):
    num = count_missing(vec)
    dem = vec.size
    return num / dem

In [121]:
pmis_col = titanic.apply(prop_missing)
print(pmis_col)

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

In [123]:
def prop_complete(vec): #비결측율 
    return 1 - prop_missing(vec)

### 8. 데이터프레임의 누락값을 처리하기 ― 행 방뱡

In [124]:
cmis_row = titanic.apply(count_missing, axis=1)
pmis_row = titanic.apply(prop_missing, axis=1)
pcom_row = titanic.apply(prop_complete, axis=1)

print(cmis_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64

In [49]:
print(pmis_row.head())

0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64

In [50]:
print(pcom_row.head())

0    0.933333
1    1.000000
2    0.933333
3    1.000000
4    0.933333
dtype: float64

In [126]:
titanic['num_missing'] = titanic.apply(count_missing, axis=1)

print(titanic.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone  num_missing
0    man        True  NaN  Southampton    no  False            1
1  woman       False    C    Cherbourg   yes  False            0
2  woman       False  NaN  Southampton   yes   True            1
3  woman       False    C  Southampton   yes  False            0
4    man        True  NaN  Southampton    no   True            1

In [53]:
print(titanic.loc[titanic.num_missing > 1, :].sample(10))

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
186         1       3  female  NaN      1      0  15.5000        Q   Third
274         1       3  female  NaN      0      0   7.7500        Q   Third
410         0       3    male  NaN      0      0   7.8958        S   Third
547         1       2    male  NaN      0      0  13.8625        C  Second
601         0       3    male  NaN      0      0   7.8958        S   Third
578         0       3  female  NaN      1      0  14.4583        C   Third
76          0       3    male  NaN      0      0   7.8958        S   Third
560         0       3    male  NaN      0      0   7.7500        Q   Third
511         0       3    male  NaN      0      0   8.0500        S   Third
495         0       3    male  NaN      0      0  14.4583        C   Third

       who  adult_male deck  embark_town alive  alone  num_missing
186  woman       False  NaN   Queenstown   yes  False            2
274  woman       False  NaN   Queenstown   yes   True            2
410    man        True  NaN  Southampton    no   True            2
547    man        True  NaN    Cherbourg   yes   True            2
601    man        True  NaN  Southampton    no   True            2
578  woman       False  NaN    Cherbourg    no  False            2
76     man        True  NaN  Southampton    no   True            2
560    man        True  NaN   Queenstown    no   True            2
511    man        True  NaN  Southampton    no   True            2
495    man        True  NaN    Cherbourg    no   True            2